In [69]:
import numpy as np
import pandas as pd

In [70]:
df = pd.read_csv("数据集.csv")
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [71]:
print(df.shape)

(1000, 8)

In [72]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 43.0+ KB

In [73]:
print(df.dtypes)

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [74]:
print(df.isna().sum()) #检查NAN

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
math score                     0
reading score                  0
writing score                  0
dtype: int64

In [75]:
#选出列类型是object的列，并获取列名
obj_cols = df.select_dtypes(include = "object").columns 
print(obj_cols)

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course'],
      dtype='object')

In [76]:
blank_cnt = (df[obj_cols].astype(str).apply(lambda s: (s.str.strip() == "").sum()))
print(blank_cnt)

# .astype(str): 把每个元素强制转成字符串
# 。astype(str)会将NAN变为nan，不会被识别为缺失值,用.astype("string")

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
dtype: int64

In [77]:
for c in obj_cols:
    df[c] = df[c].astype(str).str.strip()
    df.loc[df[c] == "",c] = np.nan

In [78]:
# 检查大小写/空格导致的同义不同写
for c in df.select_dtypes(include = "object").columns:
    raw = df[c].nunique() # 统计c列有多少个不同的值
    norm = df[c].astype(str).str.strip().str.lower().nunique()
    if(norm < raw):
        print("傻逼",c)
# 统一成小写
for c in df.select_dtypes(include = "object").columns:
    df[c] = df[c].str.strip().str.lower()

In [79]:
df["parental level of education"].unique()

array(["bachelor's degree", 'some college', "master's degree",
       "associate's degree", 'high school', 'some high school'],
      dtype=object)

In [80]:
df["parental level of education"].nunique()
df["parental level of education"].nunique(dropna = False)

6

In [81]:
df["parental level of education"].value_counts()

parental level of education
some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: count, dtype: int64

In [84]:
education_rank = {"some high school":1,"high school":2,"some college":3,
                  "associate's degree":4,"bachelor's degree":5,"master's degree":6}
df["education_rank"] = df["parental level of education"].map(education_rank)
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,education_rank
0,female,group b,bachelor's degree,standard,none,72,72,74,5
1,female,group c,some college,standard,completed,69,90,88,3
2,female,group b,master's degree,standard,none,90,95,93,6
3,male,group a,associate's degree,free/reduced,none,47,57,44,4
4,male,group c,some college,standard,none,76,78,75,3
...,...,...,...,...,...,...,...,...,...
995,female,group e,master's degree,standard,completed,88,99,95,6
996,male,group c,high school,free/reduced,none,62,55,55,2
997,female,group c,high school,free/reduced,completed,59,71,65,2
998,female,group d,some college,standard,completed,68,78,77,3
999,female,group d,some college,free/reduced,none,77,86,86,3